app/controllers/contatos_controller.rb

SELECT "contatos".* FROM "contatos"
---
  def index
    @contatos = Contato.all

INSERT INTO "contatos" ("nome", "email", "idade", "estado", "cargo", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @contato = Contato.new(contato_params)

    respond_to do |format|
      if @contato.save

UPDATE "contatos" SET "cargo" = ?, "updated_at" = ? WHERE "contatos"."id" = ?  [["cargo", "Diretor de Marketing"], ["updated_at", "2016-02-13 19:01:19.104562"], ["id", 3]]
---
  def update
    respond_to do |format|
      if @contato.update(contato_params)

DELETE FROM "contatos" WHERE "contatos"."id" = ?  [["id", 5]]
---
  def destroy
    @contato.destroy

SELECT  "contatos".* FROM "contatos" WHERE "contatos"."id" = ? LIMIT 1  [["id", 5]]
---
    def set_contato
      @contato = Contato.find(params[:id])