app/controllers/regras_controller.rb

  def index
    @regras = Regra.all
---
SELECT "regras".* FROM "regras"

  def show
    @contatos = Contato.where(@regra.criterio)
---
SELECT "contatos".* FROM "contatos" WHERE (cargo = 'Diretor de Marketing' or estado = 'SP')

  def create
    @regra = Regra.new(regra_params)

    respond_to do |format|
      if @regra.save
---
INSERT INTO "regras" ("criterio", "created_at", "updated_at") VALUES (?, ?, ?)  [["criterio", "idade > 30"], ["created_at", "2016-02-13 18:46:29.368103"], ["updated_at", "2016-02-13 18:46:29.368103"]]

  def update
    respond_to do |format|
      if @regra.update(regra_params)
---
UPDATE "regras" SET "criterio" = ?, "updated_at" = ? WHERE "regras"."id" = ?  [["criterio", "estado = 'SC' and idade in (26,30, 31,32)"], ["updated_at", "2016-02-13 19:59:22.293754"], ["id", 2]]

    def set_regra
      @regra = Regra.find(params[:id])
---
SELECT  "regras".* FROM "regras" WHERE "regras"."id" = ? LIMIT 1  [["id", 2]]